Revit 2024 API
PipeFittingAndAccessoryData.BehaviorType Property
 The behavior type of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int BehaviorType { get; }
Visual Basic
Public ReadOnly Property BehaviorType As Integer
	Get
Visual C++
public:
property int BehaviorType {
	int get ();
}
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace